app/Controllers/Auth.php

    public function processLogin()
    {
        $rules = [
            'email' => 'required|valid_email',
            'password' => 'required|min_length[6]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()
                ->withInput()
                ->with('errors', $this->validator->getErrors());
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $remember = $this->request->getPost('remember');

        // Use direct database authentication
        $db = \Config\Database::connect();
        $user = $db->table('users')
                  ->where('email', $email)
                  ->where('status', 'active')
                  ->get()
                  ->getRowArray();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@hms.com'
AND `status` = 'active'