app/Models/DoctorScheduleModel.php

    public function getDoctorWeeklySchedule($doctorId)
    {
        return $this->where('doctor_id', $doctorId)
                   ->orderBy('FIELD(day_of_week, "monday", "tuesday", "wednesday", "thursday", "friday", "saturday", "sunday")')
                   ->orderBy('start_time', 'ASC')
                   ->findAll();
---
SELECT *
FROM `doctor_schedules`
WHERE `doctor_id` = '2'
ORDER BY FIELD(day_of_week, "monday", "tuesday", "wednesday", "thursday", "friday", "saturday", "sunday"), `start_time` ASC